workloads/vllm/results/logs/20260216_232936_uvm_baseline_client.log
Command: uv run vllm bench serve --model Qwen/Qwen3-30B-A3B-FP8 --dataset-name sharegpt --num-prompts 100 --dataset-path datasets/ShareGPT_V3_unfiltered_cleaned_split.json --sharegpt-output-len 512 --seed 42 --request-rate 5
Timestamp: 2026-02-16T23:39:53.609905
============================================================
STDOUT:
INFO 02-16 23:29:57 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x71e43599d360>, seed=42, num_prompts=100, dataset_name='sharegpt', no_stream=False, dataset_path='datasets/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=512, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-30B-A3B-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed. Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  561.19    
Total input tokens:                      23501     
Total generated tokens:                  50791     
Request throughput (req/s):              0.18      
Output token throughput (tok/s):         90.51     
Peak output token throughput (tok/s):    272.00    
Peak concurrent requests:                100.00    
Total Token throughput (tok/s):          132.38    
---------------Time to First Token----------------
Mean TTFT (ms):                          261162.69 
Median TTFT (ms):                        292400.81 
P99 TTFT (ms):                           514943.93 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          152.01    
Median TPOT (ms):                        153.32    
P99 TPOT (ms):                           215.12    
---------------Inter-token Latency----------------
Mean ITL (ms):                           152.70    
Median ITL (ms):                         78.38     
P99 ITL (ms):                            480.46    
==================================================

============================================================
STDERR:

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:00 remaining
 |          | 00:30 elapsed, 371:45:22 remaining

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [01:20<2:13:36, 80.97s/it]
  2%|▏         | 2/100 [01:32<1:05:59, 40.40s/it]
  3%|▎         | 3/100 [01:42<42:45, 26.45s/it]  
  4%|▍         | 4/100 [01:45<27:04, 16.92s/it]
  6%|▌         | 6/100 [01:50<14:37,  9.33s/it]
  8%|▊         | 8/100 [01:55<09:44,  6.35s/it]
  9%|▉         | 9/100 [02:00<09:11,  6.06s/it]
 10%|█         | 10/100 [02:00<06:55,  4.61s/it]
 15%|█▌        | 15/100 [02:13<04:45,  3.36s/it]
 17%|█▋        | 17/100 [03:02<12:28,  9.02s/it]
 18%|█▊        | 18/100 [03:16<13:15,  9.71s/it]
 19%|█▉        | 19/100 [03:20<11:53,  8.81s/it]
 20%|██        | 20/100 [03:21<09:22,  7.03s/it]
 22%|██▏       | 22/100 [03:30<07:50,  6.03s/it]
 24%|██▍       | 24/100 [03:46<08:31,  6.73s/it]
 25%|██▌       | 25/100 [03:46<06:49,  5.46s/it]
 26%|██▌       | 26/100 [03:50<06:21,  5.16s/it]
 31%|███       | 31/100 [04:05<04:22,  3.80s/it]
 33%|███▎      | 33/100 [04:41<08:24,  7.53s/it]
 34%|███▍      | 34/100 [04:56<09:36,  8.73s/it]
 35%|███▌      | 35/100 [05:02<08:51,  8.17s/it]
 36%|███▌      | 36/100 [05:03<07:03,  6.62s/it]
 37%|███▋      | 37/100 [05:06<06:04,  5.79s/it]
 39%|███▉      | 39/100 [05:06<03:37,  3.57s/it]
 41%|████      | 41/100 [05:12<03:18,  3.36s/it]
 42%|████▏     | 42/100 [05:22<04:38,  4.81s/it]
 47%|████▋     | 47/100 [05:29<02:23,  2.71s/it]
 49%|████▉     | 49/100 [06:08<05:57,  7.00s/it]
 50%|█████     | 50/100 [06:15<05:45,  6.92s/it]
 51%|█████     | 51/100 [06:17<04:55,  6.03s/it]
 52%|█████▏    | 52/100 [06:17<03:57,  4.94s/it]
 53%|█████▎    | 53/100 [06:24<04:15,  5.43s/it]
 55%|█████▌    | 55/100 [06:36<04:09,  5.55s/it]
 57%|█████▋    | 57/100 [06:39<02:57,  4.14s/it]
 58%|█████▊    | 58/100 [06:39<02:20,  3.35s/it]
 63%|██████▎   | 63/100 [06:54<01:56,  3.15s/it]
 65%|██████▌   | 65/100 [07:27<03:47,  6.51s/it]
 66%|██████▌   | 66/100 [07:37<04:00,  7.08s/it]
 67%|██████▋   | 67/100 [07:39<03:22,  6.15s/it]
 68%|██████▊   | 68/100 [07:41<02:45,  5.18s/it]
 69%|██████▉   | 69/100 [07:44<02:26,  4.73s/it]
 71%|███████   | 71/100 [07:48<01:46,  3.69s/it]
 73%|███████▎  | 73/100 [07:49<01:07,  2.50s/it]
 74%|███████▍  | 74/100 [07:49<00:52,  2.03s/it]
 79%|███████▉  | 79/100 [08:12<01:14,  3.54s/it]
 81%|████████  | 81/100 [08:45<02:09,  6.81s/it]
 82%|████████▏ | 82/100 [08:52<02:03,  6.84s/it]
 83%|████████▎ | 83/100 [08:54<01:41,  5.98s/it]
 84%|████████▍ | 84/100 [08:55<01:19,  4.95s/it]
 85%|████████▌ | 85/100 [08:55<00:58,  3.92s/it]
 89%|████████▉ | 89/100 [08:55<00:19,  1.75s/it]
 90%|█████████ | 90/100 [08:56<00:14,  1.49s/it]
 96%|█████████▌| 96/100 [08:56<00:02,  1.61it/s]
 97%|█████████▋| 97/100 [09:09<00:01,  1.61it/s]
 98%|█████████▊| 98/100 [09:17<00:05,  2.81s/it]
 99%|█████████▉| 99/100 [09:20<00:02,  2.84s/it]
100%|██████████| 100/100 [09:21<00:00,  5.61s/it]