workloads/vllm/results/logs/20260216_234225_cpu_offload_client.log
Command: uv run vllm bench serve --model Qwen/Qwen3-30B-A3B-FP8 --dataset-name sharegpt --num-prompts 100 --dataset-path datasets/ShareGPT_V3_unfiltered_cleaned_split.json --sharegpt-output-len 512 --seed 42 --request-rate 5
Timestamp: 2026-02-16T23:45:25.447758
============================================================
STDOUT:
INFO 02-16 23:42:46 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7cf4b77c9360>, seed=42, num_prompts=100, dataset_name='sharegpt', no_stream=False, dataset_path='datasets/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=512, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-30B-A3B-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed. Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  140.51    
Total input tokens:                      23501     
Total generated tokens:                  51101     
Request throughput (req/s):              0.71      
Output token throughput (tok/s):         363.68    
Peak output token throughput (tok/s):    500.00    
Peak concurrent requests:                100.00    
Total Token throughput (tok/s):          530.94    
---------------Time to First Token----------------
Mean TTFT (ms):                          1119.75   
Median TTFT (ms):                        790.23    
P99 TTFT (ms):                           3021.70   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          230.06    
Median TPOT (ms):                        229.73    
P99 TPOT (ms):                           239.29    
---------------Inter-token Latency----------------
Mean ITL (ms):                           230.07    
Median ITL (ms):                         214.46    
P99 ITL (ms):                            797.69    
==================================================

============================================================
STDERR:

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:03 remaining
 |          | 00:14 elapsed, 2051:05:40 remaining

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [01:42<2:49:08, 102.51s/it]
  2%|▏         | 2/100 [01:53<1:19:19, 48.57s/it] 
  3%|▎         | 3/100 [01:58<46:46, 28.93s/it]  
  4%|▍         | 4/100 [02:00<28:48, 18.01s/it]
  5%|▌         | 5/100 [02:00<18:28, 11.67s/it]
  6%|▌         | 6/100 [02:00<12:10,  7.77s/it]
  9%|▉         | 9/100 [02:02<05:22,  3.54s/it]
 10%|█         | 10/100 [02:03<04:24,  2.94s/it]
 11%|█         | 11/100 [02:04<03:35,  2.43s/it]
 13%|█▎        | 13/100 [02:05<02:26,  1.69s/it]
 14%|█▍        | 14/100 [02:06<02:05,  1.46s/it]
 15%|█▌        | 15/100 [02:06<01:48,  1.28s/it]
 19%|█▉        | 19/100 [02:07<00:45,  1.77it/s]
 25%|██▌       | 25/100 [02:07<00:20,  3.69it/s]
 34%|███▍      | 34/100 [02:07<00:08,  7.33it/s]
 39%|███▉      | 39/100 [02:07<00:06,  9.30it/s]
 45%|████▌     | 45/100 [02:07<00:04, 12.13it/s]
 51%|█████     | 51/100 [02:08<00:03, 15.16it/s]
 54%|█████▍    | 54/100 [02:08<00:04, 11.17it/s]
 57%|█████▋    | 57/100 [02:09<00:05,  7.92it/s]
 59%|█████▉    | 59/100 [02:09<00:04,  8.27it/s]
 64%|██████▍   | 64/100 [02:09<00:03, 11.24it/s]
 68%|██████▊   | 68/100 [02:10<00:02, 13.26it/s]
 70%|███████   | 70/100 [02:10<00:02, 13.03it/s]
 72%|███████▏  | 72/100 [02:10<00:02, 10.67it/s]
 74%|███████▍  | 74/100 [02:10<00:02, 10.98it/s]
 76%|███████▌  | 76/100 [02:10<00:02, 11.25it/s]
 78%|███████▊  | 78/100 [02:10<00:01, 11.68it/s]
 80%|████████  | 80/100 [02:11<00:01, 11.97it/s]
 82%|████████▏ | 82/100 [02:11<00:01,  9.95it/s]
 85%|████████▌ | 85/100 [02:11<00:01, 12.60it/s]
 87%|████████▋ | 87/100 [02:11<00:00, 13.48it/s]
 89%|████████▉ | 89/100 [02:11<00:00, 11.94it/s]
 91%|█████████ | 91/100 [02:14<00:03,  2.33it/s]
 92%|█████████▏| 92/100 [02:16<00:04,  1.66it/s]
 93%|█████████▎| 93/100 [02:17<00:05,  1.30it/s]
 94%|█████████▍| 94/100 [02:18<00:04,  1.38it/s]
 95%|█████████▌| 95/100 [02:18<00:03,  1.40it/s]
 96%|█████████▌| 96/100 [02:19<00:02,  1.62it/s]
 97%|█████████▋| 97/100 [02:19<00:01,  1.87it/s]
 98%|█████████▊| 98/100 [02:20<00:01,  1.76it/s]
 99%|█████████▉| 99/100 [02:20<00:00,  1.93it/s]
100%|██████████| 100/100 [02:20<00:00,  2.50it/s]
100%|██████████| 100/100 [02:20<00:00,  1.41s/it]